scripts/k6/stress/stress-test-cli-report.txt
K6_WEB_DASHBOARD=true K6_WEB_DASHBOARD_EXPORT=scripts/k6/stress/stress-test-report.html k6 run scripts/k6/stress/stress.test.js

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: scripts/k6/stress/stress.test.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 45m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 45m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     data_received..................: 231 MB 86 kB/s
     data_sent......................: 82 MB  30 kB/s
     http_req_blocked...............: min=470ns    med=1.57µs   avg=1.89µs   p(90)=2.71µs   p(95)=3.22µs   max=30.24ms count=899092
     http_req_connecting............: min=0s       med=0s       avg=53ns     p(90)=0s       p(95)=0s       max=30.2ms  count=899092
     http_req_duration..............: min=156.46µs med=449.96µs avg=518.1µs  p(90)=870.27µs p(95)=1.04ms   max=38.66ms count=899092
       { expected_response:true }...: min=195.84µs med=509.64µs avg=572.93µs p(90)=959.18µs p(95)=1.13ms   max=38.66ms count=273695
     ✓ { status:200 }...............: min=195.84µs med=509.64µs avg=572.93µs p(90)=959.18µs p(95)=1.13ms   max=38.66ms count=273695
     ✓ { status:429 }...............: min=156.46µs med=430.37µs avg=494.1µs  p(90)=819.84µs p(95)=995.28µs max=37.89ms count=625397
     ✓ { status:500 }...............: min=0s       med=0s       avg=0s       p(90)=0s       p(95)=0s       max=0s      count=0     
     http_req_failed................: 69.55% ✓ 625397     ✗ 273695
     http_req_receiving.............: min=6.31µs   med=20.53µs  avg=22.51µs  p(90)=29.42µs  p(95)=36.21µs  max=3.2ms   count=899092
     http_req_sending...............: min=2.82µs   med=6.94µs   avg=7.99µs   p(90)=11.02µs  p(95)=14.04µs  max=2.07ms  count=899092
     http_req_tls_handshaking.......: min=0s       med=0s       avg=0s       p(90)=0s       p(95)=0s       max=0s      count=899092
     http_req_waiting...............: min=137.2µs  med=418.01µs avg=487.59µs p(90)=837.05µs p(95)=1.01ms   max=38.62ms count=899092
     http_reqs......................: 899092 332.971322/s
     iteration_duration.............: min=1s       med=1s       avg=1s       p(90)=1s       p(95)=1s       max=1.03s   count=449546
     iterations.....................: 449546 166.485661/s
     vus............................: 1      min=1        max=200 
     vus_max........................: 200    min=200      max=200 


running (45m00.2s), 000/200 VUs, 449546 complete and 0 interrupted iterations
default ✓ [======================================] 000/200 VUs  45m0s